#if _MSC_VER > 1000
#pragma once
#endif 

#include "VK70xNMC_DAQ2.h"
#include "dvr_header.h"
#include <Windows.h>
#include <stdio.h>


//===================================================================
// 版本说明
//===================================================================
// version history list // VK702N
//----------------------
// @4.1.2.13,
//---------------------
//  - 第一次释放版本
//----------------------
// @5.2.2.14,
//---------------------
// TCP server 异常后，自动关闭

//----------------------
// @5.2.2.15,
//---------------------
// 优化服务器连接识别
//----------------------
// @5.2.2.16
//---------------------
// 优化指针
//----------------------
// @5.3.3.17
//---------------------
// 转换C语言的编译工具
// 服务器采样 winscok 库文件, 采用双线程处理
//----------------------
// @5.3.3.18
//---------------------
// 增加绑定功能

//----------------------
// @5.3.3.19
//---------------------
// 增加ini文件兼容 labview格式

//----------------------
// @5.3.3.20
//---------------------
// 增加监测采集卡断开标志

//----------------------
// @5.3.3.21
//---------------------
//  由于下位限制 用IO1判断小于5才可以设置其它IO

//----------------------
// @5.3.3.22
//---------------------
//  增加读取IO，PWM，DAC，counter，temperature等函数操作。

//----------------------
// @5.3.3.23
//---------------------
//  增加TCPServer_Close()复位TCP/IP地址，清除已连接的缓存中IP

//----------------------
// @5.3.3.24
//---------------------
//  修改读取动态IO2、IO3的指针错误的问题
//   VK70xNMC_GetFourChannel_WithIOStatus
//   VK70xNMC_GetOneChannel_WithIOStatus

//----------------------
// @6.3.3.25A
//---------------------
//  增加SD读写函数
//  增加升级模式进入函数
//  修正IO读写函数方式和参数
//  统一模式定义内容

//----------------------
// @6.3.3.26
//---------------------
//  修正函数名称VK70xNMC_Initialize和Server_Get_ConnectedClientNumbers
//  输出 stdcall 库函数
//  修正bintotext文件函数的， 适用与V701NSD,VK702NSD


//----------------------
// @6.3.3.27
//---------------------
//  由于labview调用退出产生错误，调整线程标志状态，

//----------------------
// @6.3.3.28 
//202205252150
//---------------------
//  修改无法设置SD text 文件bug 
//  发送函数的中的bug，if (VK[mci].SDFileFormat == VKxxx_SDFILEFMT_TEXT)wbuf[i++] = 0x11; //保存文件格式 40
//  设置模式函数钟bug保存文件格式 ， trfilrfmt = 0x11;

//-------------------------------------------------------------------------------------------------------------
// @6.3.3.29 
//2022-09-17
//-------------------------------------------------------------------------------------------------------------
//    修改VK701/VK702/VK701N/VK702N 无法设置成触发模式的bug
//  A @ 2022-10-08
//    重新更新释放
//
//  B @2022-10-21
//    增加客户版本设置缺省参数
//  C @2023-02-16
//  --  增加阻塞方式读取
//  --  根据不同功能模块分成不同文件模块
//
//   D @2023-5-7 21:18
//  (1) 增加阻塞读取超时后，如果buffer有多少数据就返回多少，没有就返回0；

//   E @2023-5-20 21:18
//  (1) 增加阻塞读取超时后，如果buffer有多少数据就返回多少，没有就返回0；


//   F @2023-5-22 23:18
//  (1) 增加原始数据读取函数；

//   G @2023-5-23 22:23
//  (1) 增加原始数据读取4通道函数 VK70xNMC_GetSrcDatumFromFourChannel


//   H @2023-5-27 9:31
//  (1) 增加大于50KHZ限制采样模式

//-------------------------------------------------------------------------------------------------------------
// @6.3.3.30A 
//2023-07-08
//-------------------------------------------------------------------------------------------------------------
//   A @2023-7-8 16:35
//     -增加设置ADC和缺省前， 停止采样-  VK70xNMC_StopSampling(mci);
//     - 修改阻塞方式读取的时间 为500ms
//     - 
//  E @ 2023-10-21
//    增加定时器分辨率为1ms
//  F @ 2023-10-30
//  --增加存储或读取系统文件一定先获取当前目录，再打开或读写

//  G @ 2023-11-02
//  --取消lan接收错误传输0字符，造成设置数据偶发性出错

//  H @ 2023-12-24
//  --增加 CV 模式设置


//-------------------------------------------------------------------------------------------------------------
// @6.3.3.31A 
//2024-03-19
//-------------------------------------------------------------------------------------------------------------
//   A @2024-03-19 22:04
//     -增加UDI函数和命令

//   B @2024-05-14 22:30
//     -输出1、2、3、4 card版本， 
//     -定义static unsigned int  DLLInitializeFlag=0;  // $748167// 初始化了OK， 作为全局变量有时为0，可能存在内存越界

///////////////////////////////////////////////////////////////
char *pLotstr = "VKinging Data Sampling DLL (VC) Library for VK70xNMC Serail, LAN/WLAN Version : 6.2.3.31B, @202405142230 AJ";


char* Def_Function_OUTfmt VK70xNMC_GetVersionLot(void)//cdecl;//stdcall;//
{
	InitDLL();
	return (char *)pLotstr;
}

